Revit 2026 API

# FamilyUtils Class

---

Contains utilities related to family operations.

SystemObject Autodesk.Revit.DBFamilyUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class FamilyUtils
```
```vb
Public NotInheritable Class FamilyUtils
```
```cpp
public ref class FamilyUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FamilyUtils = class end
```

The FamilyUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConvertFamilyToFaceHostBased | Converts a family to be face host based. |
|  | FamilyCanConvertToFaceHostBased | Indicates whether the family can be converted to face host based. |
|  | GetProfileSymbols | Gets the profile Family Symbols of the document. |

#### Reference

Autodesk.Revit.DB Namespace